Ran Plan for dir: `eitch-demo-atlantis-terragrunt/us-central1/services/testing-iac/bucket/testing-iac` workspace: `default`

<details><summary>Show Output</summary>

```diff
22:47:28.814 INFO   Terragrunt Cache server is listening on 127.0.0.1:37883
22:47:28.815 INFO   Start Terragrunt Cache server
22:47:28.894 INFO   Downloading Terraform configurations from tfr:///terraform-google-modules/cloud-storage/google?version=10.0.2 into ./.terragrunt-cache/9x3w_LOTKsMwmDQL0neBiRsn9qE/nMzp8HmAhZY0B79QE6g812IfclE
22:47:29.865 INFO   Caching terraform providers for ./.terragrunt-cache/9x3w_LOTKsMwmDQL0neBiRsn9qE/nMzp8HmAhZY0B79QE6g812IfclE/modules/simple_bucket
22:47:31.953 INFO   Cached registry.terraform.io/hashicorp/google v6.37.0 (signed by HashiCorp)
22:47:32.081 INFO   terraform: Initializing the backend...
22:47:32.353 INFO   terraform: Initializing modules...
22:47:32.358 INFO   terraform: Initializing provider plugins...
22:47:32.358 INFO   terraform: - Reusing previous version of hashicorp/google from the dependency lock file
22:47:32.364 INFO   terraform: - Installing hashicorp/google v6.37.0...
22:47:32.545 INFO   terraform: - Installed hashicorp/google v6.37.0 (unauthenticated)
22:47:32.545 INFO   terraform: Terraform has been successfully initialized!
22:47:32.545 INFO   terraform: 
22:47:32.545 INFO   terraform: You may now begin working with Terraform. Try running "terraform plan" to see
22:47:32.545 INFO   terraform: any changes that are required for your infrastructure. All Terraform commands
22:47:32.545 INFO   terraform: should now work.
22:47:32.545 INFO   terraform: If you ever set or change modules or backend configuration for Terraform,
22:47:32.545 INFO   terraform: rerun this command to reinitialize your working directory. If you forget, other
22:47:32.545 INFO   terraform: commands will detect it and remind you to do so if necessary.
22:47:33.848 STDOUT terraform: data.google_storage_project_service_account.gcs_account: Reading...
22:47:33.930 STDOUT terraform: data.google_storage_project_service_account.gcs_account: Read complete after 0s [id=service-538311360123@gs-project-accounts.iam.gserviceaccount.com]
22:47:33.976 STDOUT terraform: Terraform used the selected providers to generate the following execution
22:47:33.976 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
22:47:33.976 STDOUT terraform:   + create
22:47:33.976 STDOUT terraform: Terraform will perform the following actions:
22:47:33.976 STDOUT terraform:   # google_storage_bucket.bucket will be created
22:47:33.976 STDOUT terraform:   + resource "google_storage_bucket" "bucket" {
22:47:33.977 STDOUT terraform:       + effective_labels            = {
22:47:33.977 STDOUT terraform:           + "goog-terraform-provisioned" = "true"
22:47:33.977 STDOUT terraform:           + "owner"                      = "infrastructure"
22:47:33.977 STDOUT terraform:           + "service-name"               = "testing-iac"
22:47:33.977 STDOUT terraform:         }
22:47:33.977 STDOUT terraform:       + force_destroy               = true
22:47:33.977 STDOUT terraform:       + id                          = (known after apply)
22:47:33.977 STDOUT terraform:       + labels                      = {
22:47:33.977 STDOUT terraform:           + "owner"        = "infrastructure"
22:47:33.977 STDOUT terraform:           + "service-name" = "testing-iac"
22:47:33.977 STDOUT terraform:         }
22:47:33.977 STDOUT terraform:       + location                    = "US-CENTRAL1"
22:47:33.977 STDOUT terraform:       + name                        = "eitch-demo-atlantis-terragrunt-testing-iac"
22:47:33.977 STDOUT terraform:       + project                     = "eitch-demo-atlantis-terragrunt"
22:47:33.977 STDOUT terraform:       + project_number              = (known after apply)
22:47:33.977 STDOUT terraform:       + public_access_prevention    = "inherited"
22:47:33.977 STDOUT terraform:       + rpo                         = (known after apply)
22:47:33.977 STDOUT terraform:       + self_link                   = (known after apply)
22:47:33.977 STDOUT terraform:       + storage_class               = "REGIONAL"
22:47:33.978 STDOUT terraform:       + terraform_labels            = {
22:47:33.978 STDOUT terraform:           + "goog-terraform-provisioned" = "true"
22:47:33.978 STDOUT terraform:           + "owner"                      = "infrastructure"
22:47:33.978 STDOUT terraform:           + "service-name"               = "testing-iac"
22:47:33.978 STDOUT terraform:         }
22:47:33.978 STDOUT terraform:       + time_created                = (known after apply)
22:47:33.978 STDOUT terraform:       + uniform_bucket_level_access = true
22:47:33.978 STDOUT terraform:       + updated                     = (known after apply)
22:47:33.978 STDOUT terraform:       + url                         = (known after apply)
22:47:33.978 STDOUT terraform:       + autoclass {
22:47:33.978 STDOUT terraform:           + enabled                = false
22:47:33.978 STDOUT terraform:           + terminal_storage_class = (known after apply)
22:47:33.978 STDOUT terraform:         }
22:47:33.978 STDOUT terraform:       + soft_delete_policy {
22:47:33.978 STDOUT terraform:           + effective_time             = (known after apply)
22:47:33.978 STDOUT terraform:           + retention_duration_seconds = 604800
22:47:33.978 STDOUT terraform:         }
22:47:33.978 STDOUT terraform:       + versioning {
22:47:33.978 STDOUT terraform:           + enabled = false
22:47:33.978 STDOUT terraform:         }
22:47:33.978 STDOUT terraform:       + website (known after apply)
22:47:33.978 STDOUT terraform:     }
22:47:33.978 STDOUT terraform: Plan: 1 to add, 0 to change, 0 to destroy.
22:47:33.978 STDOUT terraform: 
22:47:33.978 STDOUT terraform: Changes to Outputs:
22:47:33.978 STDOUT terraform:   + apphub_service_uri         = {
22:47:33.978 STDOUT terraform:       + location    = "us-central1"
22:47:33.979 STDOUT terraform:       + service_id  = "eitch-demo-atlantis-terragrunt-testing-iac"
22:47:33.979 STDOUT terraform:       + service_uri = (known after apply)
22:47:33.979 STDOUT terraform:     }
22:47:33.979 STDOUT terraform:   + bucket                     = {
22:47:33.979 STDOUT terraform:       + autoclass                   = [
22:47:33.979 STDOUT terraform:           + {
22:47:33.979 STDOUT terraform:               + enabled                = false
22:47:33.979 STDOUT terraform:               + terminal_storage_class = (known after apply)
22:47:33.979 STDOUT terraform:             },
22:47:33.979 STDOUT terraform:         ]
22:47:33.979 STDOUT terraform:       + cors                        = []
22:47:33.979 STDOUT terraform:       + custom_placement_config     = []
22:47:33.979 STDOUT terraform:       + default_event_based_hold    = null
22:47:33.979 STDOUT terraform:       + effective_labels            = {
22:47:33.979 STDOUT terraform:           + goog-terraform-provisioned = "true"
22:47:33.979 STDOUT terraform:           + owner                      = "infrastructure"
22:47:33.979 STDOUT terraform:           + service-name               = "testing-iac"
22:47:33.979 STDOUT terraform:         }
22:47:33.979 STDOUT terraform:       + enable_object_retention     = null
22:47:33.979 STDOUT terraform:       + encryption                  = []
22:47:33.979 STDOUT terraform:       + force_destroy               = true
22:47:33.979 STDOUT terraform:       + hierarchical_namespace      = []
22:47:33.979 STDOUT terraform:       + id                          = (known after apply)
22:47:33.979 STDOUT terraform:       + ip_filter                   = []
22:47:33.980 STDOUT terraform:       + labels                      = {
22:47:33.980 STDOUT terraform:           + owner        = "infrastructure"
22:47:33.980 STDOUT terraform:           + service-name = "testing-iac"
22:47:33.980 STDOUT terraform:         }
22:47:33.980 STDOUT terraform:       + lifecycle_rule              = []
22:47:33.980 STDOUT terraform:       + location                    = "US-CENTRAL1"
22:47:33.980 STDOUT terraform:       + logging                     = []
22:47:33.980 STDOUT terraform:       + name                        = "eitch-demo-atlantis-terragrunt-testing-iac"
22:47:33.980 STDOUT terraform:       + project                     = "eitch-demo-atlantis-terragrunt"
22:47:33.980 STDOUT terraform:       + project_number              = (known after apply)
22:47:33.980 STDOUT terraform:       + public_access_prevention    = "inherited"
22:47:33.980 STDOUT terraform:       + requester_pays              = null
22:47:33.980 STDOUT terraform:       + retention_policy            = []
22:47:33.980 STDOUT terraform:       + rpo                         = (known after apply)
22:47:33.980 STDOUT terraform:       + self_link                   = (known after apply)
22:47:33.980 STDOUT terraform:       + soft_delete_policy          = [
22:47:33.980 STDOUT terraform:           + {
22:47:33.980 STDOUT terraform:               + effective_time             = (known after apply)
22:47:33.980 STDOUT terraform:               + retention_duration_seconds = 604800
22:47:33.980 STDOUT terraform:             },
22:47:33.981 STDOUT terraform:         ]
22:47:33.981 STDOUT terraform:       + storage_class               = "REGIONAL"
22:47:33.981 STDOUT terraform:       + terraform_labels            = {
22:47:33.981 STDOUT terraform:           + goog-terraform-provisioned = "true"
22:47:33.981 STDOUT terraform:           + owner                      = "infrastructure"
22:47:33.981 STDOUT terraform:           + service-name               = "testing-iac"
22:47:33.981 STDOUT terraform:         }
22:47:33.981 STDOUT terraform:       + time_created                = (known after apply)
22:47:33.981 STDOUT terraform:       + timeouts                    = null
22:47:33.981 STDOUT terraform:       + uniform_bucket_level_access = true
22:47:33.981 STDOUT terraform:       + updated                     = (known after apply)
22:47:33.981 STDOUT terraform:       + url                         = (known after apply)
22:47:33.981 STDOUT terraform:       + versioning                  = [
22:47:33.981 STDOUT terraform:           + {
22:47:33.981 STDOUT terraform:               + enabled = false
22:47:33.981 STDOUT terraform:             },
22:47:33.981 STDOUT terraform:         ]
22:47:33.981 STDOUT terraform:       + website                     = (known after apply)
22:47:33.981 STDOUT terraform:     }
22:47:33.981 STDOUT terraform:   + name                       = "eitch-demo-atlantis-terragrunt-testing-iac"
22:47:33.981 STDOUT terraform:   + url                        = (known after apply)
22:47:33.981 STDOUT terraform: 
22:47:33.981 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
22:47:33.982 STDOUT terraform: Saved the plan to:
22:47:33.982 STDOUT terraform: ./default.tfplan
22:47:33.982 STDOUT terraform: To perform exactly these actions, run the following command to apply:
22:47:33.982 STDOUT terraform:     terraform apply "./default.tfplan"
22:47:34.040 INFO   Shutting down Terragrunt Cache server...
22:47:34.045 INFO   Terragrunt Cache server stopped

22:47:34.117 INFO   Terragrunt Cache server is listening on 127.0.0.1:45183
22:47:34.117 INFO   Start Terragrunt Cache server
22:47:34.891 INFO   Shutting down Terragrunt Cache server...
22:47:34.891 INFO   Terragrunt Cache server stopped
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d eitch-demo-atlantis-terragrunt/us-central1/services/testing-iac/bucket/testing-iac
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.eitch-consulting.com/lock?id=eitch-consulting%252Fdemo-atlantis-terragrunt%252Feitch-demo-atlantis-terragrunt%252Fus-central1%252Fservices%252Ftesting-iac%252Fbucket%252Ftesting-iac%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d eitch-demo-atlantis-terragrunt/us-central1/services/testing-iac/bucket/testing-iac
  ```
Plan: 1 to add, 0 to change, 0 to destroy.